using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsumerDataProcessor
{
    class data
    {
        private string[] Surnames =
        {
            "Андрушенко", "Артишенко", "Мармот", "Смарик", "Купер",
            "Вакуленко", "Роттус", "Стріла", "Голобородько", "Стулент", "Вайбір",
            "Дейнеженко", "Диденко", "Жиган", "Жорик", "Мищенко", "Зеленський",
            "Маг", "Кук", "Лют", "Марченко", "Миколенко", "Зінченко",
            "Опопиренко", "Остапишин", "Павлол", "Павловський", "Филипенко",
            "Руденко", "Рудик", "Староста", "Сиваченко", "Орган", "Смирнов",
            "Солонко", "Капiтан", "Суденко", "Мироненко", "Тимошенко", "Самилович",
            "Кличенко", "Хоменко","Чубаюба", "Шмайра","Шевченко", "Соха","Бебрун"
        };

        private string[] Names =
        {
            "Данило", "Артем", "Богдан", "Олександр", "Назар", "Андрiй", "Олександр",
            "Олексiй", "Денис", "Юрiй", "Олексiй", "Маргарита", "Богдан", "Артем", "Олександр",
            "Ксенiя", "Олександр", "Богдан", "Владислав", "Максим", "Ольга", "Олександр",
            "Владислав", "Дмитро", "Олександр", "Данiель", "Андрiй", "Михайло",
            "Всеволод", "Денис", "Андрiй", "Олег", "Олег", "Богдан", "Валентин",
            "Сергiй", "Ярослав", "Михайло", "Андрiй", "Денис", "Олександр",
            "Денис", "Олег", "Марта", "Назар", "Костянтин", "Юрiй"
        };
        private string[] Last_Names =
        {
            "Володимирович", "Артемович", "Богданович", "Олександрович", "Назарович", "Олегович", "Олександрович",
            "Олексiйович", "Денисович", "Юрiйович", "Олексiйович", "Iванiвна", "Богданович", "Артемович", "Олександрович",
            "Iванiвна", "Олександрович", "Богданович", "Ростиславович", "Максимович", "Максимiвна", "Олександрович",
            "Владиславович", "Дмиторвич", "Олександрович", "Артемович", "Андрiйович", "Михайлович",
            "Артемович", "Денисович", "Андрiйович", "Олегович", "Ростиславович", "Богданович", "Владиславович",
            "Владиславович", "Юрiйович", "Олегович", "Андрiйович", "Денисович", "Олександрович",
            "Денисович", "Юрiєвич", "Iванiвна", "Максимович", "Костянтинович", "Артемович"
        };
        public string getName(byte i) => Names[i];
        public byte getNamesCount() => (byte)Names.Length;
        public string getSurname(int i) => Surnames[i];
        public int getSurnamesCount() => Surnames.Length;
        public string getLast_Names(int i) => Last_Names[i];
        public int getLast_Names_count() => Last_Names.Length;

    }
}
